<?php

use Illuminate\Database\Eloquent\Model;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ApugKagajatSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Model::unguard();
        DB::table('apug_kagajats')->insert([
            ['title' => 'ठेक्का सम्झौताको र म्याद थप सम्बन्धी प्रावधानको प्रतिलिपीहरु'],            
            ['title' => 'निर्माण व्यवसायीको उयधभच या बततयचलभथ'],
            ['title' => 'निर्माण आंचार संहिता २०७० अनुसारको म्याद थप सम्बन्धी फारमका महलहरु पुर्ण रुपमा भरी प्रमाणित गरी पेश गर्नुपर्ने'],
            ['title' => 'सार्वजनिक खरिद नियमावली २०६४ को नियम १२०(२) बमोजिम दर्ता भएको प्राविधिक प्रतिवेदन'],
            ['title' => 'ऋयmउभलकबतष्यल भखभलतरल्यल ऋयmउभलकबतष्यल भ्खभलत फारम म्याद थप गर्न पर्नाको कारणलाई पुष्टी गर्ने स्पष्ट प्रमाण÷ कागजातहरु'],
            ['title' => 'म्याद थपको लागि निर्माण व्यवसायीले पेश गरेको कारण÷ औचित्यपूर्ण छ÷ छैन भनी साइट इन्जिनियरको सहमती/ सिफारिस'],
            ['title' => 'म्याद थपको लागि निर्माण व्यवसायीबाट माग भएको म्याद भित्र कार्य सम्पन्न हुने सम्भावना बारे कार्यालय को स्पष्ट राय'],
            ['title' => 'डि.कप्रमुख÷ साइट इन्जिनियर÷ विभागबाट साइटको निर्देशन÷ अनुगमन सम्बन्धी प्रतिलिपीहरु'],
            ['title' => 'म्याद थपको लागि दर्ता भएको नियमानुसारको निवेदन'],
            ['title' => 'निर्माण व्यवसायीबाट पेश भएको ीबतभकत/Latest करचुक्ताको प्रमाण पत्र'],
            ['title' => 'म्याद थप गर्दा थप आर्थिक व्ययभार हुने वा नहुने भनी निर्माण व्यवसायीको लिखित प्रतिवद्धता तथा सो को पुष्ट्याई'],
            ['title' => 'निर्माण व्यवसायीबाट समयमा काम सम्पन्न गर्ने लिखित प्रतिवद्धता '],
            ['title' => 'माग भएको म्यादको प्रमाणित संशोधित कार्य तालिका '],
            ['title' => 'भौतिक प्रगति सम्बन्धी प्रमाणित बितभकत/Latest फोटोहरु'],
            ['title' => 'अघिल्लो पटक म्याद थप हुँदाको कागजातको प्रतिलिपी'],
            ['title' => 'माग भएको म्याद अनुसार कार्यसम्पादन जमानी पत्रको म्याद अपुग भए÷ नभएकोे'],
            ['title' => 'माग भएको म्याद अनुसार ८% प्रतिशत थप कार्यसम्पादन जमानी पत्रको म्याद अपुग भए÷ नभएको '],
            ['title' => 'कार्य सम्पादन जमानी पत्र सम्बन्धित बैकबाट नै ख्भचषथ हुनु पर्ने '],
            ['title' => 'माग भएको म्याद अनुसार अग्रिम भुक्तानी जमानी पत्रको म्याद अपुग  भए÷ नभएको'],
            ['title' => 'अग्रिम भुक्तानी जमानी पत्र सम्बन्धित बैकबाट नै ख्भचषथ हुनु पर्ने'],
            ['title' => 'माग भएको म्याद अनुसार ऋयलतचबअत लबmभ र क्ष्म् खुल्ने बिमा अवधि थप भएको कागजात'],
            ['title' => 'विमाको अवधि थप भएको कागजातमा विमा सम्बन्धी रहेका प्रावधानहरु बारे सम्बन्धित कार्यालयको सहमति '],
            ['title' => 'विमाको कागजात सम्बन्धित विमा कम्पनीबाट खभचषथ हुनुपर्ने'],
            ['title' => 'निर्माण स्थलमा थप निर्माण कार्यको लागि आवश्यक सामाग्री के कति उपलब्ध भएको भनि पुष्टी हुने फोटोहरु तथा ःबतभचष्ब िीष्कत']
        ]);
    }
}
